---
kind: property
id: P:Autodesk.Revit.DB.BaseImportOptions.AutoCorrectAlmostVHLines
source: html/9b06404d-6f5f-f982-7431-94e6dd42ea50.htm
---
# Autodesk.Revit.DB.BaseImportOptions.AutoCorrectAlmostVHLines Property

Correct almost-vertical lines and almost-horizontal lines for import model
 if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.

## Syntax (C#)
```csharp
public bool AutoCorrectAlmostVHLines { get; set; }
```